run/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
		type            	groovyBC;
		gradientExpression  "-mu/k*(U & normal ())";
		variables 			"mu=0.001;";
		fractionExpression  "0";
		value				$internalField;
    }
	
	outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
	

    frontAndBackAndTopAndBottom
    {
        type            empty;
    }
	
	
}

// ************************************************************************* //
