run/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

eps0			eps0    	[0 0 0 0 0 0 0]   	0.031;
k0		   		k0			[0 2 0 0 0 0 0] 	70.2e-19;	
mu      		mu			[1 -1 -1 0 0 0 0]   0.001;
temp      		temp		[0 0 0 1 0 0 0]   	80;
dispCo      	dispCo		[0 2 -1 0 0 0 0]   	1E-9;

// ************************************************************************* //
