run/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .01;
vertices
(
    (0 0 0)
    (5.08 0 0)
    (5.08 2.032 0)
    (0 2.032 0)
    (0 0 2.032)
    (5.08 0 2.032)
    (5.08 2.032 2.032)
    (0 2.032 2.032)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (600 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 3 7 4)
        );
    }
	
	outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
	
    frontAndBackAndTopAndBottom
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
			(2 3 7 6)
			(1 0 4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
